# ColorSelectionDialog Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorSelectionDialog Class
Members See Also
---
Allows display of the Revit Color dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class ColorSelectionDialog : IDisposable
```

Visual Basic
---
```text
Public Class ColorSelectionDialog _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ColorSelectionDialog : IDisposable
```

# Remarks
The class provides the option to launch the Revit Color dialog to select the color.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..ColorSelectionDialog
# See Also
ColorSelectionDialog Members
Autodesk.Revit.UI Namespace